const obj = [
    ["تحرك داخل الكينج"],
    ["العروبة", "قرية هاني - عامرية"],
    ["فتح الله - مرغم - مانتراك","الكيلو 21","سيدرا"],
    ["بانسيا"],
    ["اكتوبر النخيل","ابو تلات"],
    ["مدينة البرج","ابو يوسف"],
    ["كارفور"],
    [ 
        "محطة مصر","مصطفى كامل","محطة الرمل",
        "محرم بيه", "كوم الدكة" , "كلوباترا" , "كامب شيزار" , "غيط العنب" , "عزبة سعد" , "سيدي جابر" , "سموحة" ,
        "سبورتنج" , "وابور المياه" , "باب شرقي" ,
        "النزهة" ,"القباري - الورديان","القائد ابراهيم",
        "الشبان المسلمين","الشاطبي","الحضرة","الجامعة" ,
        "الازاريطة" , "الابراهيمية" ,"لموقف الجديد - بدون تذكرة الدخول  -  بشاير الخير",
    ],
    [
        "رشدي  - كفر عبده","جناكليس","زيزينيا","سان ستيفانو","سبا باشا","بوكلي","مطار برج العرب ذهاب او عوده من الكينج وجيوار"
    ],
    [
        "السيوف شماعة","العوايد","المنشية","ثروت","لوران","سيدي بشر ترام","الراس السوداء","الساعة فيكتوريا"
        ,"بحري - الانفوشي - راس التين","سيدي بشر","ميامي","مطار برج العرب من اليكس ويست ذهاب او عوده"
    ],
    [
        "العصافرة من بعد شارع ٤٥","المنتزة","المندرة"
    ],
    ["مطار برج العرب ذهاب او عوده من سيدرا"],
    ["المعمورة الشاطئ"],
    [
        "ابو قير","المعمورة البلد","طوسون","مطار برج العرب ذهاب و عوده من الكينج وجيوار"
    ],
    ["مطار برج العرب من اليكس ويست ذهاب و عوده"],
    ["كفر الدوار"],
    ["مطار برج العرب - الكينج ذهاب او عوده جلوري","مطار برج العرب ذهاب و عوده من سيدرا"],
    ["مطار برج العرب - الكينج ذهاب وعوده جلوري","مطار برج العرب للكينج VIP ( كورلا - سيراتو - النترا )"],
    ["مطار برج العرب للكينج VIP ( كورلا - سيراتو - النترا ) ذ / ع"],
    ["مطار برج العرب للكينج والعكس H1"],
    ["مطار برج العرب للكينج والعكس ذهاب وعوده H1"]
]
const AlexTravelling = [
    ["ابو يوسف","الهانوفيل"],
    ["المكس -الدخيلة","البيطاش"],
    ["ابو تلات حتى كارفور"],
    ["كفر الدوار ذهاب وعوده"],
    ["من ش 45 للمنتزه"],
    ["قرية امون","مطار برج العرب حتى ميامي"],
    ["مطار برج العرب من شارع 45 للمنتزة"],
    ["مطار برج العرب من المعمورة"],
    ["مطار برج العرب من طوسون وابوقير"],
    ["مطار برج العرب VIP ( كورلا - سيراتو - النترا )"],
    ["مطار برج العرب جلوري"],
    ["مطار برج العرب حتى ميامي ذهاب و عودة"],
    ["مطار برج العرب من شارع 45 للمنتزة ذهاب و عوده","مطار برج العرب من المعمورة ذهاب و عوده"],
    ["مطار برج العرب من طوسون وابوقير ذهاب و عوده","مطار برج العرب ذهاب وعوده جلوري"," مطار برج العرب  ( كورلا - سيراتو - النترا ) Vip ذهاب و عوده"],
    ["مطار برج العرب  الاسكندريةوالعكس H1"],
    ["مطار برج العرب  الاسكندريةوالعكس ذهاب و عودهH1"]
]
const price = [80,100,120,130,140,150,160,180,200,220,240,250,260,300,320,350,400,500,700,850,1000]
const AlexTravellingPrice = [160,170,230,250,310,350,375,400,425,500,550,600,650,700,850,1000]
let Travelcontainer = document.getElementById("travel")
let tbody = document.getElementById('contain');
let travel = "الكينج"
function changeTravel(){
    if(travel == "الكينج"){
        table = ''
        for(let i = 0;i<obj.length;i++){
            for(let j = 0;j<obj[i].length;j++){
                table += `
                <tr>
                    <td>${obj[i][j]}</td>
                    <td>${price[i]}</td>
                </tr>
               
                `
            }
        }
        tbody.innerHTML = table
    }else if(travel == "الاسكندرية"){
            table = ''
            for(let i = 0;i<AlexTravelling.length;i++){
                for(let j = 0;j<AlexTravelling[i].length;j++){
                    table += `
                    <tr>
                        <td>${AlexTravelling[i][j]}</td>
                        <td>${AlexTravellingPrice[i]}</td>
                    </tr>
                   
                    `
                }
            }
            tbody.innerHTML = table
    }
}
changeTravel()
Travelcontainer.onchange = () => {
    travel = document.getElementById('travel').value
    console.log(travel);
    changeTravel()
}
function searchData(value){
    let table = '';
    for (let i = 0; i < obj.length; i++) {
        for(let j = 0;j < obj[i].length;j++){
            if (obj[i][j].includes(value.toLowerCase())) {
                table += `
                    <tr>
                        <td>${obj[i][j]}</td>
                        <td>${price[i]}</td>
                    </tr>
                `;
            }
        }
    
    
    }
        tbody.innerHTML = table
    }