const obj = [
    ["تحرك داخل الكينج"],
    ["العروبة", "قرية هاني - عامرية"],
    ["فتح الله - مرغم - مانتراك","الكيلو 21","سيدرا"],
    ["بانسيا"],
    ["اكتوبر النخيل","ابو تلات"],
    ["مدينة البرج","ابو يوسف"],
    ["كارفور"],
    [ 
        "محطة مصر","مصطفى كامل","محطة الرمل",
        "محرم بيه", "كوم الدكة" , "كلوباترا" , "كامب شيزار" , "غيط العنب" , "عزبة سعد" , "سيدي جابر" , "سموحة" ,
        "سبورتنج" , "وابور المياه" , "باب شرقي" ,
        "النزهة" ,"القباري - الورديان","القائد ابراهيم",
        "الشبان المسلمين","الشاطبي","الحضرة","الجامعة" ,
        "الازاريطة" , "الابراهيمية" ,"لموقف الجديد - بدون تذكرة الدخول  -  بشاير الخير",
    ],
    
]
const price = [80,100,120,130,140,150,160,180]
let tbody = document.getElementById('contain');
for(let i = 0;i<obj.length;i++){
    for(let j = 0;j<obj[i].length;j++){
        tbody.innerHTML += `
        <tr>
            <td>${obj[i][j]}</td>
            <td>${price[i]}</td>
        </tr>
       
        `
    }
}
function searchData(value){
let table = '';
for (let i = 0; i < obj.length; i++) {
    for(let j = 0;j < obj[i].length;j++){
        if (obj[i][j].includes(value.toLowerCase())) {
            table += `
                <tr>
                    <td>${obj[i][j]}</td>
                    <td>${price[i]}</td>
                </tr>
            `;
        }
    }


}
    tbody.innerHTML = table
}