const obj = [
    ["تحرك داخل الكينج"],
    ["العروبة", "قرية هاني - عامرية"],
    ["فتح الله - مرغم - مانتراك","الكيلو 21","سيدرا"],
    ["بانسيا"],
    ["اكتوبر النخيل","ابو تلات"],
    ["مدينة البرج","ابو يوسف"],
    ["كارفور"],
    [ 
        "محطة مصر","مصطفى كامل","محطة الرمل",
        "محرم بيه", "كوم الدكة" , "كلوباترا" , "كامب شيزار" , "غيط العنب" , "عزبة سعد" , "سيدي جابر" , "سموحة" ,
        "سبورتنج" , "وابور المياه" , "باب شرقي" ,
        "النزهة" ,"القباري - الورديان","القائد ابراهيم",
        "الشبان المسلمين","الشاطبي","الحضرة","الجامعة" ,
        "الازاريطة" , "الابراهيمية" ,"لموقف الجديد - بدون تذكرة الدخول  -  بشاير الخير",
    ],
    [
        "رشدي  - كفر عبده","جناكليس","زيزينيا","سان ستيفانو","سبا باشا","بوكلي","مطار برج العرب ذهاب او عوده من الكينج وجيوار"
    ],
    [
        "السيوف شماعة","العوايد","المنشية","ثروت","لوران","سيدي بشر ترام","الراس السوداء","الساعة فيكتوريا"
        ,"بحري - الانفوشي - راس التين","سيدي بشر","ميامي","مطار برج العرب من اليكس ويست ذهاب او عوده"
    ],
    [
        "العصافرة من بعد شارع ٤٥","المنتزة","المندرة"
    ],
    ["مطار برج العرب ذهاب او عوده من سيدرا"],
    ["المعمورة الشاطئ"],
    [
        "ابو قير","المعمورة البلد","طوسون","مطار برج العرب ذهاب و عوده من الكينج وجيوار"
    ],
    ["مطار برج العرب من اليكس ويست ذهاب و عوده"],
    ["كفر الدوار"],
    ["مطار برج العرب - الكينج ذهاب او عوده جلوري","مطار برج العرب ذهاب و عوده من سيدرا"],
    ["مطار برج العرب - الكينج ذهاب وعوده جلوري","مطار برج العرب للكينج VIP ( كورلا - سيراتو - النترا )"],
    ["مطار برج العرب للكينج VIP ( كورلا - سيراتو - النترا ) ذ / ع"],
    ["مطار برج العرب للكينج والعكس H1"],
    ["مطار برج العرب للكينج والعكس ذهاب وعوده H1"]
]
const price = [80,100,120,130,140,150,160,180,200,220,240,250,260,300,320,350,400,500,700,850,1000]
let travel = document.getElementById('travel').value
console.log(travel);
let tbody = document.getElementById('contain');
for(let i = 0;i<obj.length;i++){
    for(let j = 0;j<obj[i].length;j++){
        tbody.innerHTML += `
        <tr>
            <td>${obj[i][j]}</td>
            <td>${price[i]}</td>
        </tr>
       
        `
    }
}
function searchData(value){
let table = '';
for (let i = 0; i < obj.length; i++) {
    for(let j = 0;j < obj[i].length;j++){
        if (obj[i][j].includes(value.toLowerCase())) {
            table += `
                <tr>
                    <td>${obj[i][j]}</td>
                    <td>${price[i]}</td>
                </tr>
            `;
        }
    }


}
    tbody.innerHTML = table
}