const obj = [
    ["تحرك داخل الكينج"],
    ["العروبة", "قرية هاني - عامرية"],
    ["فتح الله - مرغم - مانتراك","الكيلو 21","سيدرا"],
    ["بانسيا"],
    ["اكتوبر النخيل","ابو تلات"],
    ["مدينة البرج","ابو يوسف"],
    ["كارفور"],
    [ 
        "محطة مصر","مصطفى كامل","محطة الرمل",
        "محرم بيه", "كوم الدكة" , "كلوباترا" , "كامب شيزار" , "غيط العنب" , "عزبة سعد" , "سيدي جابر" , "سموحة" ,
        "سبورتنج" , "وابور المياه" , "باب شرقي" ,
        "النزهة" ,"القباري - الورديان","القائد ابراهيم",
        "الشبان المسلمين","الشاطبي","الحضرة","الجامعة" ,
        "الازاريطة" , "الابراهيمية" ,"لموقف الجديد - بدون تذكرة الدخول  -  بشاير الخير",
    ],
    [
        "رشدي  - كفر عبده","جناكليس","زيزينيا","سان ستيفانو","سبا باشا","بوكلي","مطار برج العرب ذهاب او عوده من الكينج وجيوار"
    ],
    [
        "السيوف شماعة","العوايد","المنشية","ثروت","لوران","سيدي بشر ترام","الراس السوداء","الساعة فيكتوريا"
        ,"بحري - الانفوشي - راس التين","سيدي بشر","ميامي","مطار برج العرب من اليكس ويست ذهاب او عوده"
    ],
    [
        "العصافرة من بعد شارع ٤٥","المنتزة","المندرة"
    ],
    ["مطار برج العرب ذهاب او عوده من سيدرا"],
    ["المعمورة الشاطئ"],
    [
        "ابو قير","المعمورة البلد","طوسون","مطار برج العرب ذهاب و عوده من الكينج وجيوار"
    ],
    ["مطار برج العرب من اليكس ويست ذهاب و عوده"],
    ["كفر الدوار"],
    ["مطار برج العرب - الكينج ذهاب او عوده جلوري","مطار برج العرب ذهاب و عوده من سيدرا"],
    ["مطار برج العرب - الكينج ذهاب وعوده جلوري","مطار برج العرب للكينج VIP ( كورلا - سيراتو - النترا )"],
    ["مطار برج العرب للكينج VIP ( كورلا - سيراتو - النترا ) ذ / ع"],
    ["مطار برج العرب للكينج والعكس H1"],
    ["مطار برج العرب للكينج والعكس ذهاب وعوده H1"]
]
const price = [80,100,120,130,140,150,160,180,200,220,240,250,260,300,320,350,400,500,700,850,1000]
const AlexTravelling = [
    ["ابو يوسف","الهانوفيل"],
    ["المكس -الدخيلة","البيطاش"],
    ["ابو تلات حتى كارفور"],
    ["كفر الدوار ذهاب وعوده", "كرير الى محرم بيك حتى سموحة"],
    ["من قرية سيدي كرير الى من رشدي حتى جناكليس"],
    ["قرية سيدرا الى من ثروت حتى ميامي"],
    ["من ابو تلات الى من ش 45 للمنتزة"],
    ["من كرير للمعمورة"],
    ["قرية امون","مطار برج العرب حتى ميامي"],
    ["من قرية سيدي كرير حتى ابوقير - طوسون"],
    ["مطار برج العرب من شارع 45 للمنتزة"],
    ["مطار برج العرب من المعمورة"],
    ["مطار برج العرب من طوسون وابوقير"],
    ["مطار برج العرب VIP ( كورلا - سيراتو - النترا )"],
    ["مطار برج العرب جلوري"],
    ["مطار برج العرب حتى ميامي ذهاب و عودة"],
    ["مطار برج العرب من شارع 45 للمنتزة ذهاب و عوده","مطار برج العرب من المعمورة ذهاب و عوده"],
    ["مطار برج العرب من طوسون وابوقير ذهاب و عوده","مطار برج العرب ذهاب وعوده جلوري"," مطار برج العرب  ( كورلا - سيراتو - النترا ) Vip ذهاب و عوده"],
    ["مطار برج العرب  الاسكندريةوالعكس H1"],
    ["مطار برج العرب  الاسكندريةوالعكس ذهاب و عودهH1"]
]


const AlexTravellingPrice = [160,170,230,250,270,290,310,330,350,370,375,400,425,500,550,600,650,700,850,1000]



const InternalMovements = [
    ["اي تحرك داخلي الاسكندرية او كنج يبدا من"],
    ["من الكنج الي العروبة والعكس"],
    ["من الكينج الى سيدرا والعكس , من الكينج الى اليكس ويست والعكس"],
    ["من الكينج - ويست - عروبة الي بانسيا"],
    ["من الكينج - ويست - عروبة الي ابو تلات"],
    ["من اليكس ويست - الكنج الي مدينة البرج"],
    ["سيدرا الي مدينة برج العرب	"]
]
const InternalMovementsPrice = [80,100,120,130,140,150,170]

const CairoTravelTrip = [
    ["القاهرة اكتوبر والشيخ زايد - نيو جيزه - سيدان"],
    ["باقي القاهرة حتى المطار - سيدان"],
    ["ذهاب او عودة القاهرة ( مدينتي او العبور او الشروق ) - سيدان","القاهرة جلوري"],
    ["القاهرة - اكسبندر -كارنز او ما يعادلها"],
    ["ذهاب و عودة القاهرة - اكسبندر (مديني - العبور - الشروق )"],
    ["ذهاب و عودة القاهرة اكتوبر والشيخ زايد - نيو جيزه - سيدان"],
    ["ذهاب و عوده باقي القاهرة حتى المطار - سيدان","القاهرة جلوري ذهاب و عودة"],
    ["ذهاب و عودة القاهرة ( مدينتي او العبور او الشروق ) - سيدان","ذهاب او عوده  h1"],
    ["ذهاب هاي روف","القاهرة - اكسبندر -كارنز او ما يعادلها ذهاب و عودة" ],
    ["ذهاب و عودة القاهرة - اكسبندر (مديني - العبور - الشروق )"],
    ["ذهاب و عوده  h1"],
    ["ذهاب و عودة هاي روف"]
]
const CairoTravelTripPrice = [900,1000,1100,1300,1400,1600,1700,1800,2000,2100,2300,2500]
// رحلات سفر القاهرة
let Travelcontainer = document.getElementById("travel")
let tbody = document.getElementById('contain');
let travel = "الكينج"
function changeTravel(){
    if(travel == "الكينج"){
        table = ''
        for(let i = 0;i<obj.length;i++){
            for(let j = 0;j<obj[i].length;j++){
                table += `
                <tr>
                    <td>${obj[i][j]}</td>
                    <td>${price[i]}</td>
                </tr>
               
                `
            }
        }
        tbody.innerHTML = table
    }else if(travel == "الاسكندرية"){
            table = ''
            for(let i = 0;i<AlexTravelling.length;i++){
                for(let j = 0;j<AlexTravelling[i].length;j++){
                    table += `
                    <tr>
                        <td>${AlexTravelling[i][j]}</td>
                        <td>${AlexTravellingPrice[i]}</td>
                    </tr>
                   
                    `
                }
            }
            tbody.innerHTML = table
    }else if(travel == "تحركات داخلي"){
        table = ''
        for(let i = 0;i<InternalMovements.length;i++){
            for(let j = 0;j<InternalMovements[i].length;j++){
                table += `
                <tr>
                    <td>${InternalMovements[i][j]}</td>
                    <td>${InternalMovementsPrice[i]}</td>
                </tr>
               
                `
            }
        }
        tbody.innerHTML = table
    }
    else if(travel == "رحلات سفر القاهرة"){
        table = ''
        for(let i = 0;i<CairoTravelTrip.length;i++){
            for(let j = 0;j<CairoTravelTrip[i].length;j++){
                table += `
                <tr>
                    <td>${CairoTravelTrip[i][j]}</td>
                    <td>${CairoTravelTripPrice[i]}</td>
                </tr>
               
                `
            }
        }
        tbody.innerHTML = table
    }
}
changeTravel()
Travelcontainer.onchange = () => {
    travel = document.getElementById('travel').value
    changeTravel()
}
function searchData(value){
    let table = '';
    for (let i = 0; i < obj.length; i++) {
        for(let j = 0;j < obj[i].length;j++){
            if (obj[i][j].includes(value.toLowerCase())) {
                table += `
                    <tr>
                        <td>${obj[i][j]}</td>
                        <td>${price[i]}</td>
                    </tr>
                `;
            }
        }
    
    
    }
        tbody.innerHTML = table
    }